app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("room_number", "title") VALUES (?, ?)  [["room_number", 10], ["title", "Software Engineering"]]
---
  def create
    # @school_class = SchoolClass.create(title: params[:title], room_number: params[:room_number] )
    # use 'new' over 'save'
    # so you can check if that 'NEW' instance is valid without touching your db
    @school_class = SchoolClass.new(params.require(:school_class)) #WHY??
    # @school_class = SchoolClass.new
    @school_class.save #if @school_class.valid?

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params.require(:school_class))