app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-10-27 02:01:33.921243"], ["updated_at", "2016-10-27 02:01:33.921243"]]
---
  def create

    # @student = Student.create(title: params[:title], room_number: params[:room_number] )
    # use 'new' over 'save'
    # so you can check if that 'NEW' instance is valid without touching your db
    @student = Student.new(params.require(:student)) #WHY??
    # @student = Student.new
    @student.save #if @student.valid?